Конфигурация/Catalogs/ПравилаОтправкиСообщенийСВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>ПравилаОтправкиСообщенийСВД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерВсехПередаваемыхФайлов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерПередаваемогоФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыПередаваемыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортыСВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаССВДПереопределяемый/Ext/Module.bsl
Функция ПолучитьДанныеДляВыводаСостояния(СостояниеСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции	

// Сформировать сообщение СВД.
// 
// Параметры:
//  Транспорт
//  Документ
//  Контрагент
//  Организация
//  Правило
//  ФайлыДляОтправки - массив ссылок на файлы, которые необходимо отправить.
//
Функция СформироватьСообщение(Транспорт, Документ, Контрагент, Организация, Правило,
	ФайлыДляОтправки = Неопределено) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Показывает в виде HTML содержимое сообщения СВД - ИсходящееСообщениеСВД или ВходящееСообщениеСВД
Процедура ОтобразитьСообщениеСВДВHTML(ТекстHTML, СообщениеСВД) Экспорт
КонецПроцедуры	

// Возвращает правила отправки сообщений СВД по указанному транспорту.
//
Функция НайтиПравилаОтправкиСообщенийСВДПоТранспорту(Транспорт) Экспорт
	
	Если ТипЗнч(Транспорт) <> Тип("СправочникСсылка.ТранспортыСВД") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПравилаОтправкиСообщенийСВД.Ссылка
		|ИЗ
		|	Справочник.ПравилаОтправкиСообщенийСВД КАК ПравилаОтправкиСообщенийСВД
		|ГДЕ
		|	ПравилаОтправкиСообщенийСВД.ПометкаУдаления = ЛОЖЬ
		|	И ПравилаОтправкиСообщенийСВД.Транспорт = &Транспорт";
	Запрос.УстановитьПараметр("Транспорт", Транспорт);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	                                                                                                        
КонецФункции
